jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x47xx.cpp
#ifndef MPYC
#define MPYC (1<<0)
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef MPY_
#define MPY_ __MSP430_MPY32_BASE__ + 0x00
#endif
#ifndef MPY
#define MPY __MSP430_MPY32_BASE__ + 0x00
#endif
#ifndef XCAP10PF
#define XCAP10PF 0x10
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef TIMER0_B1_VECTOR
#define TIMER0_B1_VECTOR 24
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __MSP430_HAS_PORT3_R__
#define __MSP430_HAS_PORT3_R__ 
#endif
#ifndef __MSP430_HAS_PORT3_R_
#define __MSP430_HAS_PORT3_R_ 
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef __FLT_MIN_
#define __FLT_MIN_ 1.17549435e-38F
#endif
#ifndef LCDFREQ_256
#define LCDFREQ_256 (5<<5)
#endif
#ifndef LCDAPCTL0_
#define LCDAPCTL0_ 0x00AC
#endif
#ifndef LCDAPCTL0
#define LCDAPCTL0 0x00AC
#endif
#ifndef SCFQ_512K
#define SCFQ_512K 0x0F
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef P1IES
#define P1IES 0x0024
#endif
#ifndef LCDAPCTL1_
#define LCDAPCTL1_ 0x00AD
#endif
#ifndef LCDAPCTL1
#define LCDAPCTL1 0x00AD
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __ASSEMBLER_
#define __ASSEMBLER_ 1
#endif
#ifndef VLD0
#define VLD0 (1<<4)
#endif
#ifndef VLD2
#define VLD2 (4<<4)
#endif
#ifndef VLD3
#define VLD3 (8<<4)
#endif
#ifndef SD16_VECTOR
#define SD16_VECTOR 14
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef __CHAR_BIT_
#define __CHAR_BIT_ 8
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef P5DIR
#define P5DIR 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef SELM_DCO
#define SELM_DCO 0x00
#endif
#ifndef SD16CTL_
#define SD16CTL_ 0x0100
#endif
#ifndef SD16CTL
#define SD16CTL 0x0100
#endif
#ifndef SD16GAIN1
#define SD16GAIN1 0x0010
#endif
#ifndef P8OUT_
#define P8OUT_ 0x003B
#endif
#ifndef P8OUT
#define P8OUT 0x003B
#endif
#ifndef SMCLKOFF
#define SMCLKOFF 0x40
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef __WINT_MAX_
#define __WINT_MAX_ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef TA0R
#define TA0R 0x0170
#endif
#ifndef BTCTL_
#define BTCTL_ 0x0040
#endif
#ifndef BTCTL
#define BTCTL 0x0040
#endif
#ifndef RTCDAY_
#define RTCDAY_ 0x004C
#endif
#ifndef RTCDAY
#define RTCDAY 0x004C
#endif
#ifndef P8SEL_
#define P8SEL_ 0x003F
#endif
#ifndef P8SEL
#define P8SEL 0x003F
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __SIZE_MAX_
#define __SIZE_MAX_ 65535U
#endif
#ifndef LCDM10_
#define LCDM10_ LCD_BASE+0xA
#endif
#ifndef LCDM10
#define LCDM10 LCD_BASE+0xA
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef __WCHAR_MAX_
#define __WCHAR_MAX_ 32767
#endif
#ifndef RTCMON_
#define RTCMON_ 0x004D
#endif
#ifndef RTCMON
#define RTCMON 0x004D
#endif
#ifndef PAIN_
#define PAIN_ 0x0038
#endif
#ifndef PAIN
#define PAIN 0x0038
#endif
#ifndef __msp430_headers_sd16_h__
#define __msp430_headers_sd16_h__ 
#endif
#ifndef __msp430_headers_sd16_h_
#define __msp430_headers_sd16_h_ 
#endif
#ifndef LCDM11_
#define LCDM11_ LCD_BASE+0xB
#endif
#ifndef LCDM11
#define LCDM11 LCD_BASE+0xB
#endif
#ifndef UCB1I2CIE_
#define UCB1I2CIE_ 0x00DC
#endif
#ifndef UCB1I2CIE
#define UCB1I2CIE 0x00DC
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef SCFQ_256K
#define SCFQ_256K 0x07
#endif
#ifndef LCDCPEN
#define LCDCPEN 0x08
#endif
#ifndef LCDM12_
#define LCDM12_ LCD_BASE+0xC
#endif
#ifndef LCDM12
#define LCDM12 LCD_BASE+0xC
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef P3IN
#define P3IN 0x0018
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef __FLT_EVAL_METHOD_
#define __FLT_EVAL_METHOD_ 0
#endif
#ifndef LCDM13_
#define LCDM13_ LCD_BASE+0xD
#endif
#ifndef LCDM13
#define LCDM13 LCD_BASE+0xD
#endif
#ifndef RES0_
#define RES0_ __MSP430_MPY32_BASE__ + 0x24
#endif
#ifndef RES0
#define RES0 __MSP430_MPY32_BASE__ + 0x24
#endif
#ifndef UCA1RXIFG
#define UCA1RXIFG (1<<0)
#endif
#ifndef XT2OF
#define XT2OF 0x08
#endif
#ifndef P3REN_
#define P3REN_ 0x0010
#endif
#ifndef P3REN
#define P3REN 0x0010
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SD16OSR0
#define SD16OSR0 0x0100
#endif
#ifndef SD16OSR1
#define SD16OSR1 0x0200
#endif
#ifndef LCDM14_
#define LCDM14_ LCD_BASE+0xE
#endif
#ifndef LCDM14
#define LCDM14 LCD_BASE+0xE
#endif
#ifndef RES1_
#define RES1_ __MSP430_MPY32_BASE__ + 0x26
#endif
#ifndef RES1
#define RES1 __MSP430_MPY32_BASE__ + 0x26
#endif
#ifndef OUTMOD_2
#define OUTMOD_2 (2<<5)
#endif
#ifndef LCDM15_
#define LCDM15_ LCD_BASE+0xF
#endif
#ifndef LCDM15
#define LCDM15 LCD_BASE+0xF
#endif
#ifndef RES2_
#define RES2_ __MSP430_MPY32_BASE__ + 0x28
#endif
#ifndef RES2
#define RES2 __MSP430_MPY32_BASE__ + 0x28
#endif
#ifndef SELS
#define SELS 0x04
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef UCA1BR0_
#define UCA1BR0_ 0x00D2
#endif
#ifndef UCA1BR0
#define UCA1BR0 0x00D2
#endif
#ifndef XCAP0PF
#define XCAP0PF 0x00
#endif
#ifndef LCDM16_
#define LCDM16_ LCD_BASE+0x10
#endif
#ifndef LCDM16
#define LCDM16 LCD_BASE+0x10
#endif
#ifndef UCB0RXIFG
#define UCB0RXIFG (1<<2)
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef UCA1BR1_
#define UCA1BR1_ 0x00D3
#endif
#ifndef UCA1BR1
#define UCA1BR1 0x00D3
#endif
#ifndef LCDM17_
#define LCDM17_ LCD_BASE+0x11
#endif
#ifndef LCDM17
#define LCDM17 LCD_BASE+0x11
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef SD16SNGL
#define SD16SNGL 0x0400
#endif
#ifndef UCB1RXBUF_
#define UCB1RXBUF_ 0x00DE
#endif
#ifndef UCB1RXBUF
#define UCB1RXBUF 0x00DE
#endif
#ifndef __MSP430_HAS_PORT2_R__
#define __MSP430_HAS_PORT2_R__ 
#endif
#ifndef __MSP430_HAS_PORT2_R_
#define __MSP430_HAS_PORT2_R_ 
#endif
#ifndef LCDM18_
#define LCDM18_ LCD_BASE+0x12
#endif
#ifndef LCDM18
#define LCDM18 LCD_BASE+0x12
#endif
#ifndef UCSSEL_UCLKI
#define UCSSEL_UCLKI UCSSEL_0
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __FINITE_MATH_ONLY_
#define __FINITE_MATH_ONLY_ 0
#endif
#ifndef LCDM19_
#define LCDM19_ LCD_BASE+0x13
#endif
#ifndef LCDM19
#define LCDM19 LCD_BASE+0x13
#endif
#ifndef MPYPO2_32
#define MPYPO2_32 (1<<7)
#endif
#ifndef SD16SSEL_MCLK
#define SD16SSEL_MCLK SD16SSEL_0
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef __GNUC_PATCHLEVEL_
#define __GNUC_PATCHLEVEL_ 3
#endif
#ifndef XCAP14PF
#define XCAP14PF 0x20
#endif
#ifndef BTIE
#define BTIE (1<<7)
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef TBCTL
#define TBCTL 0x0180
#endif
#ifndef RESHI_
#define RESHI_ __MSP430_MPY32_BASE__ + 0x0C
#endif
#ifndef RESHI
#define RESHI __MSP430_MPY32_BASE__ + 0x0C
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef P4DIR
#define P4DIR 0x001E
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef __DEC64_MAX_EXP_
#define __DEC64_MAX_EXP_ 385
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef SD16SSEL0
#define SD16SSEL0 0x0010
#endif
#ifndef SD16SSEL1
#define SD16SSEL1 0x0020
#endif
#ifndef P7OUT_
#define P7OUT_ 0x003A
#endif
#ifndef P7OUT
#define P7OUT 0x003A
#endif
#ifndef SD16OSR_32
#define SD16OSR_32 (3<<8)
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __SHRT_MAX_
#define __SHRT_MAX_ 32767
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef __LDBL_MAX_
#define __LDBL_MAX_ 3.40282347e+38L
#endif
#ifndef MPYM1
#define MPYM1 (1<<5)
#endif
#ifndef P10REN_
#define P10REN_ 0x0017
#endif
#ifndef P10REN
#define P10REN 0x0017
#endif
#ifndef P7SEL_
#define P7SEL_ 0x003E
#endif
#ifndef P7SEL
#define P7SEL 0x003E
#endif
#ifndef SD16OSR_64
#define SD16OSR_64 (2<<8)
#endif
#ifndef TBCLGRP_2
#define TBCLGRP_2 (2<<13)
#endif
#ifndef __MSP430_HAS_SD16_CH2__
#define __MSP430_HAS_SD16_CH2__ 
#endif
#ifndef __MSP430_HAS_SD16_CH2_
#define __MSP430_HAS_SD16_CH2_ 
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef LCD_BASE
#define LCD_BASE 0x90
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef BT_fCLK2_DIV2
#define BT_fCLK2_DIV2 0
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __UINTMAX_TYPE_
#define __UINTMAX_TYPE_ long long unsigned int
#endif
#ifndef SD16CCTL2_
#define SD16CCTL2_ 0x0106
#endif
#ifndef SD16CCTL2
#define SD16CCTL2 0x0106
#endif
#ifndef __MSP430_HAS_PORTB__
#define __MSP430_HAS_PORTB__ 
#endif
#ifndef __MSP430_HAS_PORTB_
#define __MSP430_HAS_PORTB_ 
#endif
#ifndef P2REN_
#define P2REN_ 0x002F
#endif
#ifndef P2REN
#define P2REN 0x002F
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef __DEC32_EPSILON_
#define __DEC32_EPSILON_ 1E-6DF
#endif
#ifndef UCSSEL_0
#define UCSSEL_0 (0<<6)
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef MPYS_
#define MPYS_ __MSP430_MPY32_BASE__ + 0x02
#endif
#ifndef MPYS
#define MPYS __MSP430_MPY32_BASE__ + 0x02
#endif
#ifndef MPY32CTL0_
#define MPY32CTL0_ __MSP430_MPY32_BASE__ + 0x2C
#endif
#ifndef MPY32CTL0
#define MPY32CTL0 __MSP430_MPY32_BASE__ + 0x2C
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef IE1
#define IE1 0x0000
#endif
#ifndef __msp430_headers_usci_h__
#define __msp430_headers_usci_h__ 
#endif
#ifndef __msp430_headers_usci_h_
#define __msp430_headers_usci_h_ 
#endif
#ifndef UCA0BR0_
#define UCA0BR0_ 0x0062
#endif
#ifndef UCA0BR0
#define UCA0BR0 0x0062
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef TIMER0_A0_VECTOR
#define TIMER0_A0_VECTOR 12
#endif
#ifndef SVSFG
#define SVSFG 0x01
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef __LDBL_MAX_EXP_
#define __LDBL_MAX_EXP_ 128
#endif
#ifndef TASSEL_1
#define TASSEL_1 (1<<8)
#endif
#ifndef TASSEL_2
#define TASSEL_2 (2<<8)
#endif
#ifndef TASSEL_3
#define TASSEL_3 (3<<8)
#endif
#ifndef UCA0BR1_
#define UCA0BR1_ 0x0063
#endif
#ifndef UCA0BR1
#define UCA0BR1 0x0063
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef __WINT_MIN_
#define __WINT_MIN_ 0U
#endif
#ifndef SELM_A
#define SELM_A 0x18
#endif
#ifndef __MSP430_HAS_PORT1_R__
#define __MSP430_HAS_PORT1_R__ 
#endif
#ifndef __MSP430_HAS_PORT1_R_
#define __MSP430_HAS_PORT1_R_ 
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef P10IN_
#define P10IN_ 0x0009
#endif
#ifndef P10IN
#define P10IN 0x0009
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef __SCHAR_MAX_
#define __SCHAR_MAX_ 127
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef P2IFG
#define P2IFG 0x002B
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef UCB1BR0_
#define UCB1BR0_ 0x00DA
#endif
#ifndef UCB1BR0
#define UCB1BR0 0x00DA
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef TACTL
#define TACTL TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef __DBL_DIG_
#define __DBL_DIG_ 6
#endif
#ifndef SD16DF
#define SD16DF 0x0010
#endif
#ifndef UCB1BR1_
#define UCB1BR1_ 0x00DB
#endif
#ifndef UCB1BR1
#define UCB1BR1 0x00DB
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef P3DIR
#define P3DIR 0x001A
#endif
#ifndef DCOF
#define DCOF 0x01
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_INT_
#define __SIZEOF_INT_ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef __SIZEOF_POINTER_
#define __SIZEOF_POINTER_ 2
#endif
#ifndef SVSON
#define SVSON 0x04
#endif
#ifndef SVSOP
#define SVSOP 0x02
#endif
#ifndef SELM0
#define SELM0 0x08
#endif
#ifndef SELM1
#define SELM1 0x10
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1_
#endif
#ifndef SD16XOSR
#define SD16XOSR 0x0800
#endif
#ifndef XCAP18PF
#define XCAP18PF 0x30
#endif
#ifndef CAF
#define CAF 0x02
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef UCB0I2COA_
#define UCB0I2COA_ 0x0118
#endif
#ifndef UCB0I2COA
#define UCB0I2COA 0x0118
#endif
#ifndef SD16IE
#define SD16IE 0x0008
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef __USER_LABEL_PREFIX_
#define __USER_LABEL_PREFIX_ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __STDC_HOSTED_
#define __STDC_HOSTED_ 1
#endif
#ifndef SD16LP
#define SD16LP 0x0100
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef __LDBL_HAS_INFINITY_
#define __LDBL_HAS_INFINITY_ 1
#endif
#ifndef SD16LSBTOG
#define SD16LSBTOG 0x0080
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef MPYM0
#define MPYM0 (1<<4)
#endif
#ifndef __MSP430_HAS_USCI0__
#define __MSP430_HAS_USCI0__ 
#endif
#ifndef __MSP430_HAS_USCI0_
#define __MSP430_HAS_USCI0_ 
#endif
#ifndef P1REN_
#define P1REN_ 0x0027
#endif
#ifndef P1REN
#define P1REN 0x0027
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef RTCDOW
#define RTCDOW RTCNT4
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SD16AE0
#define SD16AE0 0x0001
#endif
#ifndef SD16AE1
#define SD16AE1 0x0002
#endif
#ifndef SD16AE2
#define SD16AE2 0x0004
#endif
#ifndef SD16AE3
#define SD16AE3 0x0008
#endif
#ifndef SD16AE4
#define SD16AE4 0x0010
#endif
#ifndef SD16AE5
#define SD16AE5 0x0020
#endif
#ifndef SD16AE6
#define SD16AE6 0x0040
#endif
#ifndef SD16AE7
#define SD16AE7 0x0080
#endif
#ifndef RESLO_
#define RESLO_ __MSP430_MPY32_BASE__ + 0x0A
#endif
#ifndef RESLO
#define RESLO __MSP430_MPY32_BASE__ + 0x0A
#endif
#ifndef LCDS12
#define LCDS12 0x08
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __FLT_EPSILON_
#define __FLT_EPSILON_ 1.19209290e-7F
#endif
#ifndef LCDS16
#define LCDS16 0x10
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef VLCD_14
#define VLCD_14 (13<<1)
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef __MSP430_
#define __MSP430_ 1
#endif
#ifndef LCDS20
#define LCDS20 0x20
#endif
#ifndef LCDS24
#define LCDS24 0x40
#endif
#ifndef LCDS28
#define LCDS28 0x80
#endif
#ifndef MPYDLYWRTEN
#define MPYDLYWRTEN (1<<8)
#endif
#ifndef LCDS32
#define LCDS32 0x01
#endif
#ifndef LCDS36
#define LCDS36 0x02
#endif
#ifndef P10DIR_
#define P10DIR_ 0x000D
#endif
#ifndef P10DIR
#define P10DIR 0x000D
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __LDBL_MIN_
#define __LDBL_MIN_ 1.17549435e-38L
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef __msp430_headers_system_clock_h
#define __msp430_headers_system_clock_h 
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef __DEC32_MAX_
#define __DEC32_MAX_ 9.999999E96DF
#endif
#ifndef MACS32H_
#define MACS32H_ __MSP430_MPY32_BASE__ + 0x1E
#endif
#ifndef MACS32H
#define MACS32H __MSP430_MPY32_BASE__ + 0x1E
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef P1IFG
#define P1IFG 0x0023
#endif
#ifndef UCB0BR0_
#define UCB0BR0_ 0x006A
#endif
#ifndef UCB0BR0
#define UCB0BR0 0x006A
#endif
#ifndef UCA1TXIE
#define UCA1TXIE (1<<1)
#endif
#ifndef UCB0BR1_
#define UCB0BR1_ 0x006B
#endif
#ifndef UCB0BR1
#define UCB0BR1 0x006B
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef __SIZEOF_LONG_
#define __SIZEOF_LONG_ 4
#endif
#ifndef VLCD_0
#define VLCD_0 (0<<1)
#endif
#ifndef VLCD_1
#define VLCD_1 (1<<1)
#endif
#ifndef VLCD_2
#define VLCD_2 (2<<1)
#endif
#ifndef VLCD_3
#define VLCD_3 (3<<1)
#endif
#ifndef VLCD_4
#define VLCD_4 (4<<1)
#endif
#ifndef VLCD_5
#define VLCD_5 (5<<1)
#endif
#ifndef VLCD_6
#define VLCD_6 (6<<1)
#endif
#ifndef VLCD_7
#define VLCD_7 (7<<1)
#endif
#ifndef VLCD_8
#define VLCD_8 (8<<1)
#endif
#ifndef VLCD_9
#define VLCD_9 (9<<1)
#endif
#ifndef MACS32L_
#define MACS32L_ __MSP430_MPY32_BASE__ + 0x1C
#endif
#ifndef MACS32L
#define MACS32L __MSP430_MPY32_BASE__ + 0x1C
#endif
#ifndef VLDON
#define VLDON 0x10
#endif
#ifndef SCFQ_M
#define SCFQ_M 0x80
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef P5OUT
#define P5OUT 0x0031
#endif
#ifndef USCIAB1TX_VECTOR
#define USCIAB1TX_VECTOR 4
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef __DECIMAL_DIG_
#define __DECIMAL_DIG_ 9
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef TBIV
#define TBIV 0x011E
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef SD16SSEL_SMCLK
#define SD16SSEL_SMCLK SD16SSEL_1
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef TIMER0_A1_VECTOR
#define TIMER0_A1_VECTOR 10
#endif
#ifndef UCA1RXBUF_
#define UCA1RXBUF_ 0x00D6
#endif
#ifndef UCA1RXBUF
#define UCA1RXBUF 0x00D6
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef P5SEL
#define P5SEL 0x0033
#endif
#ifndef OP2H_
#define OP2H_ __MSP430_MPY32_BASE__ + 0x22
#endif
#ifndef OP2H
#define OP2H __MSP430_MPY32_BASE__ + 0x22
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef UC1IFG_
#define UC1IFG_ 0x0007
#endif
#ifndef UC1IFG
#define UC1IFG 0x0007
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __LDBL_HAS_QUIET_NAN_
#define __LDBL_HAS_QUIET_NAN_ 1
#endif
#ifndef WDTIFG
#define WDTIFG (1<<0)
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef __msp430_headers_svs_h
#define __msp430_headers_svs_h 
#endif
#ifndef UCB1TXBUF_
#define UCB1TXBUF_ 0x00DF
#endif
#ifndef UCB1TXBUF
#define UCB1TXBUF 0x00DF
#endif
#ifndef OP2L_
#define OP2L_ __MSP430_MPY32_BASE__ + 0x20
#endif
#ifndef OP2L
#define OP2L __MSP430_MPY32_BASE__ + 0x20
#endif
#ifndef RTCSEC
#define RTCSEC RTCNT1
#endif
#ifndef VLCD_10
#define VLCD_10 (10<<1)
#endif
#ifndef VLCD_11
#define VLCD_11 (11<<1)
#endif
#ifndef VLCD_12
#define VLCD_12 (12<<1)
#endif
#ifndef VLCD_13
#define VLCD_13 (12<<1)
#endif
#ifndef VLCD_15
#define VLCD_15 (15<<1)
#endif
#ifndef LCDR03EXT
#define LCDR03EXT 0x40
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef __GNUC_
#define __GNUC_ 4
#endif
#ifndef UCB0I2CSA_
#define UCB0I2CSA_ 0x011A
#endif
#ifndef UCB0I2CSA
#define UCB0I2CSA 0x011A
#endif
#ifndef SD16DIV_DIV8
#define SD16DIV_DIV8 SD16DIV_3
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 2
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __FLT_HAS_DENORM_
#define __FLT_HAS_DENORM_ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef __SIZEOF_LONG_DOUBLE_
#define __SIZEOF_LONG_DOUBLE_ 4
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef RTCHOUR
#define RTCHOUR RTCNT3
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef TBSSEL_SMCLK
#define TBSSEL_SMCLK TBSSEL_2
#endif
#ifndef LCDFREQ_384
#define LCDFREQ_384 (6<<5)
#endif
#ifndef __msp430_have_lcd_16_20
#define __msp430_have_lcd_16_20 
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __BIGGEST_ALIGNMENT_
#define __BIGGEST_ALIGNMENT_ 2
#endif
#ifndef __MSP430_HAS_PORT10_R__
#define __MSP430_HAS_PORT10_R__ 
#endif
#ifndef __MSP430_HAS_PORT10_R_
#define __MSP430_HAS_PORT10_R_ 
#endif
#ifndef ID_0
#define ID_0 (0<<6)
#endif
#ifndef ID_1
#define ID_1 (1<<6)
#endif
#ifndef ID_2
#define ID_2 (2<<6)
#endif
#ifndef ID_3
#define ID_3 (3<<6)
#endif
#ifndef UCA1IRRCTL_
#define UCA1IRRCTL_ 0x00CF
#endif
#ifndef UCA1IRRCTL
#define UCA1IRRCTL 0x00CF
#endif
#ifndef P9IN_
#define P9IN_ 0x0008
#endif
#ifndef P9IN
#define P9IN 0x0008
#endif
#ifndef UCB0TXIFG
#define UCB0TXIFG (1<<3)
#endif
#ifndef BT_ADLY_0_064
#define BT_ADLY_0_064 0
#endif
#ifndef BTRESET
#define BTRESET 0x40
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef __DBL_HAS_INFINITY_
#define __DBL_HAS_INFINITY_ 1
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0_
#endif
#ifndef SD16INTDLY_2
#define SD16INTDLY_2 (2<<6)
#endif
#ifndef CAREF_OFF
#define CAREF_OFF CAREF_0
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef VLCDEXT
#define VLCDEXT 0x10
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1_
#endif
#ifndef CCIS_1
#define CCIS_1 (1<<12)
#endif
#ifndef CCIS_2
#define CCIS_2 (2<<12)
#endif
#ifndef CCIS_3
#define CCIS_3 (3<<12)
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef P1DIR
#define P1DIR 0x0022
#endif
#ifndef BTFRFQ0
#define BTFRFQ0 0x08
#endif
#ifndef BTFRFQ1
#define BTFRFQ1 0x10
#endif
#ifndef LCDM20_
#define LCDM20_ LCD_BASE+0x14
#endif
#ifndef LCDM20
#define LCDM20 LCD_BASE+0x14
#endif
#ifndef FLL_DIV0
#define FLL_DIV0 0x01
#endif
#ifndef FLL_DIV1
#define FLL_DIV1 0x02
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2_
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef P4OUT
#define P4OUT 0x001D
#endif
#ifndef UCA0STAT_
#define UCA0STAT_ 0x0065
#endif
#ifndef UCA0STAT
#define UCA0STAT 0x0065
#endif
#ifndef UCBRF_0
#define UCBRF_0 (0x0<<4)
#endif
#ifndef UCBRF_1
#define UCBRF_1 (0x1<<4)
#endif
#ifndef UCBRF_2
#define UCBRF_2 (0x2<<4)
#endif
#ifndef UCBRF_3
#define UCBRF_3 (0x3<<4)
#endif
#ifndef UCBRF_4
#define UCBRF_4 (0x4<<4)
#endif
#ifndef UCBRF_5
#define UCBRF_5 (0x5<<4)
#endif
#ifndef UCBRF_6
#define UCBRF_6 (0x6<<4)
#endif
#ifndef UCBRF_7
#define UCBRF_7 (0x7<<4)
#endif
#ifndef UCBRF_8
#define UCBRF_8 (0x8<<4)
#endif
#ifndef UCBRF_9
#define UCBRF_9 (0x9<<4)
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef __msp430_headers_timerb_h_
#define __msp430_headers_timerb_h_ 
#endif
#ifndef UCA1ABCTL_
#define UCA1ABCTL_ 0x00CD
#endif
#ifndef UCA1ABCTL
#define UCA1ABCTL 0x00CD
#endif
#ifndef MPYDLY32
#define MPYDLY32 (1<<9)
#endif
#ifndef UCA0IRTCTL_
#define UCA0IRTCTL_ 0x005E
#endif
#ifndef UCA0IRTCTL
#define UCA0IRTCTL 0x005E
#endif
#ifndef SD16SC
#define SD16SC 0x0002
#endif
#ifndef UCSSEL_SMCLK
#define UCSSEL_SMCLK UCSSEL_2
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef P4SEL
#define P4SEL 0x001F
#endif
#ifndef VLCDREF0
#define VLCDREF0 0x02
#endif
#ifndef VLCDREF1
#define VLCDREF1 0x04
#endif
#ifndef BT_fLCD_1K
#define BT_fLCD_1K 0
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef P2DIR
