jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x47xx.cpp
#define P2DIR 0x002A
#endif
#ifndef UCB1TXIE
#define UCB1TXIE (1<<3)
#endif
#ifndef LCDSON
#define LCDSON 0x04
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef __LDBL_HAS_DENORM_
#define __LDBL_HAS_DENORM_ 1
#endif
#ifndef VLD_1
#define VLD_1 (1<<4)
#endif
#ifndef VLD_2
#define VLD_2 (2<<4)
#endif
#ifndef VLD_3
#define VLD_3 (3<<4)
#endif
#ifndef VLD_4
#define VLD_4 (4<<4)
#endif
#ifndef VLD_5
#define VLD_5 (5<<4)
#endif
#ifndef VLD_6
#define VLD_6 (6<<4)
#endif
#ifndef VLD_7
#define VLD_7 (7<<4)
#endif
#ifndef VLD_8
#define VLD_8 (8<<4)
#endif
#ifndef VLD_9
#define VLD_9 (9<<4)
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __DEC128_MAX_
#define __DEC128_MAX_ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __USING_SJLJ_EXCEPTIONS_
#define __USING_SJLJ_EXCEPTIONS_ 1
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef __DEC32_MIN_
#define __DEC32_MIN_ 1E-95DF
#endif
#ifndef SVSCTL_
#define SVSCTL_ 0x0056
#endif
#ifndef SVSCTL
#define SVSCTL 0x0056
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef TAR
#define TAR TA0R_
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DBL_MAX_EXP_
#define __DBL_MAX_EXP_ 128
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef __DEC128_EPSILON_
#define __DEC128_EPSILON_ 1E-33DL
#endif
#ifndef P9REN_
#define P9REN_ 0x0016
#endif
#ifndef P9REN
#define P9REN 0x0016
#endif
#ifndef MPY32L_
#define MPY32L_ __MSP430_MPY32_BASE__ + 0x10
#endif
#ifndef MPY32L
#define MPY32L __MSP430_MPY32_BASE__ + 0x10
#endif
#ifndef SCFQ_1M
#define SCFQ_1M 0x1F
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef __PTRDIFF_MAX_
#define __PTRDIFF_MAX_ 2147483647L
#endif
#ifndef UCA0CTL0_
#define UCA0CTL0_ 0x0060
#endif
#ifndef UCA0CTL0
#define UCA0CTL0 0x0060
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef __MSP430_HAS_WDT_
#define __MSP430_HAS_WDT_ 
#endif
#ifndef SCFQ_2M
#define SCFQ_2M 0x3F
#endif
#ifndef UCA0CTL1_
#define UCA0CTL1_ 0x0061
#endif
#ifndef UCA0CTL1
#define UCA0CTL1 0x0061
#endif
#ifndef SD16INCTL0_
#define SD16INCTL0_ 0x00B0
#endif
#ifndef SD16INCTL0
#define SD16INCTL0 0x00B0
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef SD16OSR_128
#define SD16OSR_128 (1<<8)
#endif
#ifndef SD16INCTL1_
#define SD16INCTL1_ 0x00B1
#endif
#ifndef SD16INCTL1
#define SD16INCTL1 0x00B1
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef UCMODE_0
#define UCMODE_0 (0<<1)
#endif
#ifndef UCMODE_1
#define UCMODE_1 (1<<1)
#endif
#ifndef UCMODE_2
#define UCMODE_2 (2<<1)
#endif
#ifndef UCMODE_3
#define UCMODE_3 (3<<1)
#endif
#ifndef SD16INCTL2_
#define SD16INCTL2_ 0x00B2
#endif
#ifndef SD16INCTL2
#define SD16INCTL2 0x00B2
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __LONG_LONG_MAX_
#define __LONG_LONG_MAX_ 9223372036854775807LL
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef __SIZEOF_SIZE_T_
#define __SIZEOF_SIZE_T_ 2
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef __SIZEOF_WINT_T_
#define __SIZEOF_WINT_T_ 2
#endif
#ifndef P9DIR_
#define P9DIR_ 0x000C
#endif
#ifndef P9DIR
#define P9DIR 0x000C
#endif
#ifndef USCIAB0TX_VECTOR
#define USCIAB0TX_VECTOR 16
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef IE2
#define IE2 0x0001
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef P3OUT
#define P3OUT 0x0019
#endif
#ifndef MPY32H_
#define MPY32H_ __MSP430_MPY32_BASE__ + 0x12
#endif
#ifndef MPY32H
#define MPY32H __MSP430_MPY32_BASE__ + 0x12
#endif
#ifndef SD16GAIN0
#define SD16GAIN0 0x0008
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef __msp430_headers_timera_h_
#define __msp430_headers_timera_h_ 
#endif
#ifndef MPYM_0
#define MPYM_0 (0<<4)
#endif
#ifndef MPYM_1
#define MPYM_1 (1<<4)
#endif
#ifndef MPYM_2
#define MPYM_2 (2<<4)
#endif
#ifndef MPYM_3
#define MPYM_3 (3<<4)
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef UCA0TXIE
#define UCA0TXIE (1<<1)
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P1IE
#define P1IE 0x0025
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR TIMER0_B1_VECTOR
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TA0IV
#define TA0IV 0x012E
#endif
#ifndef SD16DIV0
#define SD16DIV0 0x0040
#endif
#ifndef SD16DIV1
#define SD16DIV1 0x0080
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef TBCCR0
#define TBCCR0 0x0192
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef IFG1
#define IFG1 0x0002
#endif
#ifndef SD16INCH_0
#define SD16INCH_0 (0<<0)
#endif
#ifndef SD16INCH_1
#define SD16INCH_1 (1<<0)
#endif
#ifndef SD16INCH_2
#define SD16INCH_2 (2<<0)
#endif
#ifndef SD16INCH_3
#define SD16INCH_3 (3<<0)
#endif
#ifndef SD16INCH_4
#define SD16INCH_4 (4<<0)
#endif
#ifndef SD16INCH_5
#define SD16INCH_5 (5<<0)
#endif
#ifndef SD16INCH_6
#define SD16INCH_6 (6<<0)
#endif
#ifndef SD16INCH_7
#define SD16INCH_7 (7<<0)
#endif
#ifndef SD16BUF_0
#define SD16BUF_0 (0<<13)
#endif
#ifndef SD16BUF_1
#define SD16BUF_1 (1<<13)
#endif
#ifndef SD16BUF_2
#define SD16BUF_2 (2<<13)
#endif
#ifndef SD16BUF_3
#define SD16BUF_3 (3<<13)
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TBCCR1
#define TBCCR1 0x0194
#endif
#ifndef VLCD_2_60
#define VLCD_2_60 (1<<1)
#endif
#ifndef VLCD_2_66
#define VLCD_2_66 (2<<1)
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef CACTL1
#define CACTL1 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef TBCCR2
#define TBCCR2 0x0196
#endif
#ifndef CACTL24
#define CACTL24 0x10
#endif
#ifndef CACTL25
#define CACTL25 0x20
#endif
#ifndef CACTL26
#define CACTL26 0x40
#endif
#ifndef CACTL27
#define CACTL27 0x80
#endif
#ifndef VLCD_2_72
#define VLCD_2_72 (3<<1)
#endif
#ifndef VLCD_2_78
#define VLCD_2_78 (4<<1)
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef CACTL2
#define CACTL2 0x005A
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCTL0
#define TBCCTL0 0x0182
#endif
#ifndef FLL_DIV_1
#define FLL_DIV_1 0x00
#endif
#ifndef FLL_DIV_2
#define FLL_DIV_2 0x01
#endif
#ifndef FLL_DIV_4
#define FLL_DIV_4 0x02
#endif
#ifndef FLL_DIV_8
#define FLL_DIV_8 0x03
#endif
#ifndef VLCD_2_84
#define VLCD_2_84 (5<<1)
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef __MSP430_IVCNT_
#define __MSP430_IVCNT_ 16
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBCCTL1
#define TBCCTL1 0x0184
#endif
#ifndef __MSP430_HAS_COMPA__
#define __MSP430_HAS_COMPA__ 
#endif
#ifndef __MSP430_HAS_COMPA_
#define __MSP430_HAS_COMPA_ 
#endif
#ifndef VLCD_2_90
#define VLCD_2_90 (6<<1)
#endif
#ifndef VLCD_2_96
#define VLCD_2_96 (7<<1)
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCTL2
#define TBCCTL2 0x0186
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef FCTL1
#define FCTL1 0x0128
#endif
#ifndef UCB1TXIFG
#define UCB1TXIFG (1<<3)
#endif
#ifndef __MSP430_MPY32_BASE__
#define __MSP430_MPY32_BASE__ 0x140
#endif
#ifndef __MSP430_MPY32_BASE_
#define __MSP430_MPY32_BASE_ 0x140
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef FCTL2
#define FCTL2 0x012A
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef FCTL3
#define FCTL3 0x012C
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P1IN
#define P1IN 0x0020
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef P10OUT_
#define P10OUT_ 0x000B
#endif
#ifndef P10OUT
#define P10OUT 0x000B
#endif
#ifndef MC_0
#define MC_0 (0<<4)
#endif
#ifndef MC_1
#define MC_1 (1<<4)
#endif
#ifndef MC_2
#define MC_2 (2<<4)
#endif
#ifndef MC_3
#define MC_3 (3<<4)
#endif
#ifndef UCA1TXBUF_
#define UCA1TXBUF_ 0x00D7
#endif
#ifndef UCA1TXBUF
#define UCA1TXBUF 0x00D7
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef RES3_
#define RES3_ __MSP430_MPY32_BASE__ + 0x2A
#endif
#ifndef RES3
#define RES3 __MSP430_MPY32_BASE__ + 0x2A
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef UCA1CTL0_
#define UCA1CTL0_ 0x00D0
#endif
#ifndef UCA1CTL0
#define UCA1CTL0 0x00D0
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __DEC128_MIN_
#define __DEC128_MIN_ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __REGISTER_PREFIX_
#define __REGISTER_PREFIX_ 
#endif
#ifndef SD16REFON
#define SD16REFON 0x0004
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef __DBL_HAS_DENORM_
#define __DBL_HAS_DENORM_ 1
#endif
#ifndef UCA1CTL1_
#define UCA1CTL1_ 0x00D1
#endif
#ifndef UCA1CTL1
#define UCA1CTL1 0x00D1
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef P2OUT
#define P2OUT 0x0029
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef VLCDREF_0
#define VLCDREF_0 (0<<1)
#endif
#ifndef VLCDREF_1
#define VLCDREF_1 (1<<1)
#endif
#ifndef VLCDREF_2
#define VLCDREF_2 (2<<1)
#endif
#ifndef VLCDREF_3
#define VLCDREF_3 (3<<1)
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_TA3_
#define __MSP430_HAS_TA3_ 
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef __MSP430_HAS_FLASH_
#define __MSP430_HAS_FLASH_ 
#endif
#ifndef LCDREXT
#define LCDREXT 0x20
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __NO_INLINE_
#define __NO_INLINE_ 1
#endif
#ifndef PBIN_
#define PBIN_ 0x0008
#endif
#ifndef PBIN
#define PBIN 0x0008
#endif
#ifndef __MSP430_HAS_USCI_AB0__
#define __MSP430_HAS_USCI_AB0__ 
#endif
#ifndef __MSP430_HAS_USCI_AB0_
#define __MSP430_HAS_USCI_AB0_ 
#endif
#ifndef SD16IV_
#define SD16IV_ __MSP430_SD16IV_BASE__
#endif
#ifndef SD16IV
#define SD16IV __MSP430_SD16IVBASE__
#endif
#ifndef __MSP430_HAS_USCI1__
#define __MSP430_HAS_USCI1__ 
#endif
#ifndef __MSP430_HAS_USCI1_
#define __MSP430_HAS_USCI1_ 
#endif
#ifndef UCA0IRRCTL_
#define UCA0IRRCTL_ 0x005F
#endif
#ifndef UCA0IRRCTL
#define UCA0IRRCTL 0x005F
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef P2SEL
#define P2SEL 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __FLT_MANT_DIG_
#define __FLT_MANT_DIG_ 24
#endif
#ifndef SD16INCH0
#define SD16INCH0 0x0001
#endif
#ifndef SD16INCH2
#define SD16INCH2 0x0004
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef __VERSION_
#define __VERSION_ "4.5.3"
#endif
#ifndef RTCMODE_0
#define RTCMODE_0 (0<<4)
#endif
#ifndef RTCMODE_1
#define RTCMODE_1 (1<<4)
#endif
#ifndef RTCMODE_2
#define RTCMODE_2 (2<<4)
#endif
#ifndef RTCMODE_3
#define RTCMODE_3 (3<<4)
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef WDTCTL
#define WDTCTL 0x0120
#endif
#ifndef FLL_CTL0_
#define FLL_CTL0_ 0x0053
#endif
#ifndef FLL_CTL0
#define FLL_CTL0 0x0053
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef FLL_CTL1_
#define FLL_CTL1_ 0x0054
#endif
#ifndef FLL_CTL1
#define FLL_CTL1 0x0054
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef TA0CCTL0
#define TA0CCTL0 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef MAC32H_
#define MAC32H_ __MSP430_MPY32_BASE__ + 0x1A
#endif
#ifndef MAC32H
#define MAC32H __MSP430_MPY32_BASE__ + 0x1A
#endif
#ifndef P10SEL_
#define P10SEL_ 0x000F
#endif
#ifndef P10SEL
#define P10SEL 0x000F
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef TA0CCTL1
#define TA0CCTL1 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __IOMACROS_H
#define __IOMACROS_H 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef TA0CCTL2
#define TA0CCTL2 0x0166
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef P4IN
#define P4IN 0x001C
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef SD16XDIV0
#define SD16XDIV0 0x0200
#endif
#ifndef SD16XDIV1
#define SD16XDIV1 0x0400
#endif
#ifndef MAC32L_
#define MAC32L_ __MSP430_MPY32_BASE__ + 0x18
#endif
#ifndef MAC32L
#define MAC32L __MSP430_MPY32_BASE__ + 0x18
#endif
#ifndef SD16OSR_256
#define SD16OSR_256 (0<<8)
#endif
#ifndef CNTL_0
#define CNTL_0 (0<<11)
#endif
#ifndef CNTL_1
#define CNTL_1 (1<<11)
#endif
#ifndef CNTL_2
#define CNTL_2 (2<<11)
#endif
#ifndef CNTL_3
#define CNTL_3 (3<<11)
#endif
#ifndef UCA1RXIE
#define UCA1RXIE (1<<0)
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef SUMEXT_
#define SUMEXT_ __MSP430_MPY32_BASE__ + 0x0E
#endif
#ifndef SUMEXT
#define SUMEXT __MSP430_MPY32_BASE__ + 0x0E
#endif
#ifndef TIMER0_B0_VECTOR
#define TIMER0_B0_VECTOR 26
#endif
#ifndef SD16OVIFG
#define SD16OVIFG 0x0020
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef P1OUT
#define P1OUT 0x0021
#endif
#ifndef OP2_
#define OP2_ __MSP430_MPY32_BASE__ + 0x08
#endif
#ifndef OP2
#define OP2 __MSP430_MPY32_BASE__ + 0x08
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef __DEC64_EPSILON_
#define __DEC64_EPSILON_ 1E-15DD
#endif
#ifndef UCB1RXIFG
#define UCB1RXIFG (1<<2)
#endif
#ifndef VLD_OFF
#define VLD_OFF (0<<4)
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef P1SEL
#define P1SEL 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef UCB0I2CIE_
#define UCB0I2CIE_ 0x006C
#endif
#ifndef UCB0I2CIE
#define UCB0I2CIE 0x006C
#endif
#ifndef SD16INTDLY_0
#define SD16INTDLY_0 (0<<6)
#endif
#ifndef SD16INTDLY_1
#define SD16INTDLY_1 (1<<6)
#endif
#ifndef SD16INTDLY_3
#define SD16INTDLY_3 (3<<6)
#endif
#ifndef __MSP430_HAS_PORT9_R__
#define __MSP430_HAS_PORT9_R__ 
#endif
#ifndef __MSP430_HAS_PORT9_R_
#define __MSP430_HAS_PORT9_R_ 
#endif
#ifndef NMIIE
#define NMIIE (1<<4)
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __SIZE_TYPE_
#define __SIZE_TYPE_ unsigned int
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef LCDM1_
#define LCDM1_ LCDMEM_
#endif
#ifndef LCDM1
#define LCDM1 LCDMEM_
#endif
#ifndef SELM_XT2
#define SELM_XT2 0x10
#endif
#ifndef VLD1
#define VLD1 (2<<4)
#endif
#ifndef SD16INTDLY0
#define SD16INTDLY0 0x0040
#endif
#ifndef SD16INTDLY1
#define SD16INTDLY1 0x0080
#endif
#ifndef BTDIV
#define BTDIV 0x20
#endif
#ifndef LCDM2_
#define LCDM2_ LCD_BASE+0x2
#endif
#ifndef LCDM2
#define LCDM2 LCD_BASE+0x2
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef BT_fLCD_DIV32
#define BT_fLCD_DIV32 0
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LCDM3_
#define LCDM3_ LCD_BASE+0x3
#endif
#ifndef LCDM3
#define LCDM3 LCD_BASE+0x3
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef RTCTL_
#define RTCTL_ 0x0040
#endif
#ifndef RTCTL
#define RTCTL 0x0040
#endif
#ifndef LCDM4_
#define LCDM4_ LCD_BASE+0x4
#endif
#ifndef LCDM4
#define LCDM4 LCD_BASE+0x4
#endif
#ifndef UCB0RXBUF_
#define UCB0RXBUF_ 0x006E
#endif
#ifndef UCB0RXBUF
#define UCB0RXBUF 0x006E
#endif
#ifndef P7IN_
#define P7IN_ 0x0038
#endif
#ifndef P7IN
#define P7IN 0x0038
#endif
#ifndef __MSP430_HEADERS_MPY32_H
#define __MSP430_HEADERS_MPY32_H 
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __FLT_RADIX_
#define __FLT_RADIX_ 2
#endif
#ifndef LCDAVCTL0_
#define LCDAVCTL0_ 0x00AE
#endif
#ifndef LCDAVCTL0
#define LCDAVCTL0 0x00AE
#endif
#ifndef LCDM5_
#define LCDM5_ LCD_BASE+0x5
#endif
#ifndef LCDM5
#define LCDM5 LCD_BASE+0x5
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR TIMER0_B0_VECTOR
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef __LDBL_EPSILON_
#define __LDBL_EPSILON_ 1.19209290e-7L
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef LCDAVCTL1_
#define LCDAVCTL1_ 0x00AF
#endif
#ifndef LCDAVCTL1
#define LCDAVCTL1 0x00AF
#endif
#ifndef LCDM6_
#define LCDM6_ LCD_BASE+0x6
#endif
#ifndef LCDM6
#define LCDM6 LCD_BASE+0x6
#endif
#ifndef FLLD0
#define FLLD0 0x40
#endif
#ifndef FLLD1
#define FLLD1 0x80
#endif
#ifndef LCDM7_
#define LCDM7_ LCD_BASE+0x7
#endif
#ifndef LCDM7
#define LCDM7 LCD_BASE+0x7
#endif
#ifndef UCA0RXIE
#define UCA0RXIE (1<<0)
#endif
#ifndef LCDM8_
#define LCDM8_ LCD_BASE+0x8
#endif
#ifndef LCDM8
#define LCDM8 LCD_BASE+0x8
#endif
#ifndef UCB0TXIE
#define UCB0TXIE (1<<3)
#endif
#ifndef SD16IFG
#define SD16IFG 0x0004
#endif
#ifndef LCDM9_
#define LCDM9_ LCD_BASE+0x9
#endif
#ifndef LCDM9
#define LCDM9 LCD_BASE+0x9
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef UCSSEL_ACLK
#define UCSSEL_ACLK UCSSEL_1
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef SD16CCTL0_
#define SD16CCTL0_ 0x0102
#endif
#ifndef SD16CCTL0
#define SD16CCTL0 0x0102
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef __SIZEOF_PTRDIFF_T_
#define __SIZEOF_PTRDIFF_T_ 4
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef SD16CCTL1_
#define SD16CCTL1_ 0x0104
#endif
#ifndef SD16CCTL1
#define SD16CCTL1 0x0104
#endif
#ifndef CM_0
#define CM_0 (0<<14)
#endif
#ifndef CM_1
#define CM_1 (1<<14)
#endif
#ifndef CM_2
#define CM_2 (2<<14)
#endif
#ifndef CM_3
#define CM_3 (3<<14)
#endif
#ifndef CLLD_0
#define CLLD_0 (0<<9)
#endif
#ifndef CLLD_1
#define CLLD_1 (1<<9)
#endif
#ifndef CLLD_2
#define CLLD_2 (2<<9)
#endif
#ifndef CLLD_3
#define CLLD_3 (3<<9)
#endif
#ifndef SD16MEM0_
#define SD16MEM0_ __MSP430_SD16MEM_BASE__ + 0x00
#endif
#ifndef SD16MEM0
#define SD16MEM0 __MSP430_SD16MEM_BASE__ + 0x00
#endif
#ifndef UCB1RXIE
#define UCB1RXIE (1<<2)
#endif
#ifndef SD16MEM1_
#define SD16MEM1_ __MSP430_SD16MEM_BASE__ + 0x02
#endif
#ifndef SD16MEM1
#define SD16MEM1 __MSP430_SD16MEM_BASE__ + 0x02
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef TBR
#define TBR 0x0190
#endif
#ifndef SD16MEM2_
#define SD16MEM2_ __MSP430_SD16MEM_BASE__ + 0x04
#endif
#ifndef SD16MEM2
#define SD16MEM2 __MSP430_SD16MEM_BASE__ + 0x04
#endif
#ifndef __MSP430_HAS_BT_RTC__
#define __MSP430_HAS_BT_RTC__ 
#endif
#ifndef __MSP430_HAS_BT_RTC_
#define __MSP430_HAS_BT_RTC_ 
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef __DEC32_SUBNORMAL_MIN_
#define __DEC32_SUBNORMAL_MIN_ 0.000001E-95DF
#endif
#ifndef TBSSEL_0
#define TBSSEL_0 (0<<8)
#endif
#ifndef TBSSEL_1
#define TBSSEL_1 (1<<8)
#endif
#ifndef TBSSEL_2
#define TBSSEL_2 (2<<8)
#endif
#ifndef TBSSEL_3
#define TBSSEL_3 (3<<8)
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef __MSP430_HAS_PORT8_R__
#define __MSP430_HAS_PORT8_R__ 
#endif
#ifndef __MSP430_HAS_PORT8_R_
#define __MSP430_HAS_PORT8_R_ 
#endif
#ifndef SD16SSEL_ACLK
#define SD16SSEL_ACLK SD16SSEL_2
#endif
#ifndef LCDMA_
#define LCDMA_ LCDM10_
#endif
#ifndef LCDMA
#define LCDMA LCDM10_
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef __MSP430F110_
#define __MSP430F110_ 1
#endif
#ifndef LCDMEM_
#define LCDMEM_ LCD_BASE+1
#endif
#ifndef LCDMEM
#define LCDMEM LCD_BASE+1
#endif
#ifndef LCDMB_
#define LCDMB_ LCDM11_
#endif
#ifndef LCDMB
#define LCDMB LCDM11_
#endif
#ifndef UC1IE_
#define UC1IE_ 0x0006
#endif
#ifndef UC1IE
#define UC1IE 0x0006
#endif
#ifndef LCDMC_
#define LCDMC_ LCDM12_
#endif
#ifndef LCDMC
#define LCDMC LCDM12_
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_HAS_QUIET_NAN_
#define __FLT_HAS_QUIET_NAN_ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __FLT_MAX_10_EXP_
#define __FLT_MAX_10_EXP_ 38
#endif
#ifndef LCDFREQ_32
#define LCDFREQ_32 (0<<5)
#endif
#ifndef RTCMIN
#define RTCMIN RTCNT2
#endif
#ifndef LCDMD_
#define LCDMD_ LCDM13_
#endif
#ifndef LCDMD
#define LCDMD LCDM13_
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __LONG_MAX_
#define __LONG_MAX_ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __DEC128_SUBNORMAL_MIN_
#define __DEC128_SUBNORMAL_MIN_ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef RTCNT1_
#define RTCNT1_ 0x0042
#endif
#ifndef RTCNT1
#define RTCNT1 0x0042
#endif
#ifndef LCDMEM
#define LCDMEM LCDMEM_
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef __FLT_HAS_INFINITY_
#define __FLT_HAS_INFINITY_ 1
#endif
#ifndef LCDME_
#define LCDME_ LCDM14_
#endif
#ifndef LCDME
#define LCDME LCDM14_
#endif
#ifndef BT_fCLK2_MCLK
#define BT_fCLK2_MCLK BTSSEL
#endif
#ifndef SD16GAIN2
#define SD16GAIN2 0x0020
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef __MSP430_HAS_FLLPLUS__
#define __MSP430_HAS_FLLPLUS__ 
#endif
#ifndef __MSP430_HAS_FLLPLUS_
#define __MSP430_HAS_FLLPLUS_ 
#endif
#ifndef __MSP430_HAS_SD16_A__
#define __MSP430_HAS_SD16_A__ 
#endif
#ifndef __MSP430_HAS_SD16_A_
#define __MSP430_HAS_SD16_A_ 
#endif
#ifndef RTCNT2_
#define RTCNT2_ 0x0043
#endif
#ifndef RTCNT2
#define RTCNT2 0x0043
#endif
#ifndef LCDMF_
#define LCDMF_ LCDM15_
#endif
#ifndef LCDMF
#define LCDMF LCDM15_
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef __DEC64_MAX_
#define __DEC64_MAX_ 9.999999999999999E384DD
#endif
#ifndef LCDFREQ_64
#define LCDFREQ_64 (1<<5)
#endif
#ifndef RTCNT3_
#define RTCNT3_ 0x0044
#endif
#ifndef RTCNT3
#define RTCNT3 0x0044
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR TIMER0_A1_VECTOR
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef __CHAR16_TYPE_
#define __CHAR16_TYPE_ short unsigned int
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TA0CCR0
#define TA0CCR0 0x0172
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef RTCNT4_
#define RTCNT4_ 0x0045
#endif
#ifndef RTCNT4
#define RTCNT4 0x0045
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef TA0CCR1
#define TA0CCR1 0x0174
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef __DEC64_MANT_DIG_
#define __DEC64_MANT_DIG_ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef TA0CCR2
#define TA0CCR2 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef LCDFREQ_96
#define LCDFREQ_96 (2<<5)
#endif
#ifndef P8REN_
#define P8REN_ 0x0015
#endif
