jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x47xx.cpp
#ifndef P8REN
#define P8REN 0x0015
#endif
#ifndef UCB1I2COA_
#define UCB1I2COA_ 0x017C
#endif
#ifndef UCB1I2COA
#define UCB1I2COA 0x017C
#endif
#ifndef LCD2B
#define LCD2B 0x01
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef P3SEL
#define P3SEL 0x001B
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef __DEC32_MAX_EXP_
#define __DEC32_MAX_EXP_ 97
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef __MSP430_HAS_LCD_A__
#define __MSP430_HAS_LCD_A__ 
#endif
#ifndef __MSP430_HAS_LCD_A_
#define __MSP430_HAS_LCD_A_ 
#endif
#ifndef SLSHR_0
#define SLSHR_0 (0<<9)
#endif
#ifndef SLSHR_1
#define SLSHR_1 (1<<9)
#endif
#ifndef SLSHR_2
#define SLSHR_2 (2<<9)
#endif
#ifndef SLSHR_3
#define SLSHR_3 (3<<9)
#endif
#ifndef XT2OFF
#define XT2OFF 0x20
#endif
#ifndef UCB0RXIE
#define UCB0RXIE (1<<2)
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef WDTIE
#define WDTIE (1<<0)
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef MPYS32H_
#define MPYS32H_ __MSP430_MPY32_BASE__ + 0x16
#endif
#ifndef MPYS32H
#define MPYS32H __MSP430_MPY32_BASE__ + 0x16
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef __LDBL_MANT_DIG_
#define __LDBL_MANT_DIG_ 24
#endif
#ifndef __MSP430_HAS_PORT7_R__
#define __MSP430_HAS_PORT7_R__ 
#endif
#ifndef __MSP430_HAS_PORT7_R_
#define __MSP430_HAS_PORT7_R_ 
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef ACCVIE
#define ACCVIE (1<<5)
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef __DBL_HAS_QUIET_NAN_
#define __DBL_HAS_QUIET_NAN_ 1
#endif
#ifndef SD16BUF1
#define SD16BUF1 0x4000
#endif
#ifndef LCDFREQ_128
#define LCDFREQ_128 (3<<5)
#endif
#ifndef MPYPO1_32
#define MPYPO1_32 (1<<6)
#endif
#ifndef MPYS32L_
#define MPYS32L_ __MSP430_MPY32_BASE__ + 0x14
#endif
#ifndef MPYS32L
#define MPYS32L __MSP430_MPY32_BASE__ + 0x14
#endif
#ifndef SD16VMIDON
#define SD16VMIDON 0x0008
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __WCHAR_TYPE_
#define __WCHAR_TYPE_ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef __SIZEOF_FLOAT_
#define __SIZEOF_FLOAT_ 4
#endif
#ifndef LCDMX0
#define LCDMX0 0x08
#endif
#ifndef LCDMX1
#define LCDMX1 0x10
#endif
#ifndef SD16UNI
#define SD16UNI 0x1000
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef UCBRF_10
#define UCBRF_10 (0xA<<4)
#endif
#ifndef UCBRF_11
#define UCBRF_11 (0xB<<4)
#endif
#ifndef UCBRF_12
#define UCBRF_12 (0xC<<4)
#endif
#ifndef UCBRF_13
#define UCBRF_13 (0xD<<4)
#endif
#ifndef UCBRF_14
#define UCBRF_14 (0xE<<4)
#endif
#ifndef UCBRF_15
#define UCBRF_15 (0xF<<4)
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __FLT_DIG_
#define __FLT_DIG_ 6
#endif
#ifndef VLCD_3_02
#define VLCD_3_02 (8<<1)
#endif
#ifndef VLCD_3_08
#define VLCD_3_08 (9<<1)
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef __MSPGCC_
#define __MSPGCC_ 20110706
#endif
#ifndef LCDFREQ_192
#define LCDFREQ_192 (4<<5)
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef __MSP430_HAS_USCI_AB1__
#define __MSP430_HAS_USCI_AB1__ 
#endif
#ifndef __MSP430_HAS_USCI_AB1_
#define __MSP430_HAS_USCI_AB1_ 
#endif
#ifndef VLCD_3_14
#define VLCD_3_14 (10<<1)
#endif
#ifndef LCDFREQ0
#define LCDFREQ0 0x20
#endif
#ifndef LCDFREQ1
#define LCDFREQ1 0x40
#endif
#ifndef LCDFREQ2
#define LCDFREQ2 0x80
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef __INT_MAX_
#define __INT_MAX_ 32767
#endif
#ifndef MACS_
#define MACS_ __MSP430_MPY32_BASE__ + 0x06
#endif
#ifndef MACS
#define MACS __MSP430_MPY32_BASE__ + 0x06
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef VLCD_3_20
#define VLCD_3_20 (11<<1)
#endif
#ifndef VLCD_3_26
#define VLCD_3_26 (12<<1)
#endif
#ifndef SD16GAIN_16
#define SD16GAIN_16 (4<<3)
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef __msp430_headers_basic_timer_h
#define __msp430_headers_basic_timer_h 
#endif
#ifndef VLCD_3_32
#define VLCD_3_32 (12<<1)
#endif
#ifndef VLCD_3_38
#define VLCD_3_38 (13<<1)
#endif
#ifndef USCIAB1RX_VECTOR
#define USCIAB1RX_VECTOR 6
#endif
#ifndef SD16GAIN_32
#define SD16GAIN_32 (5<<3)
#endif
#ifndef VLCD_3_44
#define VLCD_3_44 (15<<1)
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef P2IE
#define P2IE 0x002D
#endif
#ifndef P7REN_
#define P7REN_ 0x0014
#endif
#ifndef P7REN
#define P7REN 0x0014
#endif
#ifndef XTS_FLL
#define XTS_FLL 0x40
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef __FLT_MAX_EXP_
#define __FLT_MAX_EXP_ 128
#endif
#ifndef UCA0RXBUF_
#define UCA0RXBUF_ 0x0066
#endif
#ifndef UCA0RXBUF
#define UCA0RXBUF 0x0066
#endif
#ifndef OUTMOD_0
#define OUTMOD_0 (0<<5)
#endif
#ifndef OUTMOD_1
#define OUTMOD_1 (1<<5)
#endif
#ifndef OUTMOD_3
#define OUTMOD_3 (3<<5)
#endif
#ifndef OUTMOD_4
#define OUTMOD_4 (4<<5)
#endif
#ifndef OUTMOD_5
#define OUTMOD_5 (5<<5)
#endif
#ifndef OUTMOD_6
#define OUTMOD_6 (6<<5)
#endif
#ifndef OUTMOD_7
#define OUTMOD_7 (7<<5)
#endif
#ifndef TBCLGRP_0
#define TBCLGRP_0 (0<<13)
#endif
#ifndef TBCLGRP_1
#define TBCLGRP_1 (1<<13)
#endif
#ifndef TBCLGRP_3
#define TBCLGRP_3 (3<<13)
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DBL_MANT_DIG_
#define __DBL_MANT_DIG_ 24
#endif
#ifndef UCB1I2CSA_
#define UCB1I2CSA_ 0x017E
#endif
#ifndef UCB1I2CSA
#define UCB1I2CSA 0x017E
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __DEC64_MIN_
#define __DEC64_MIN_ 1E-383DD
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __WINT_TYPE_
#define __WINT_TYPE_ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef __SIZEOF_SHORT_
#define __SIZEOF_SHORT_ 2
#endif
#ifndef UCB0TXBUF_
#define UCB0TXBUF_ 0x006F
#endif
#ifndef UCB0TXBUF
#define UCB0TXBUF 0x006F
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef __msp430_headers_lcd_a_h
#define __msp430_headers_lcd_a_h 
#endif
#ifndef RTCYEARH_
#define RTCYEARH_ 0x004F
#endif
#ifndef RTCYEARH
#define RTCYEARH 0x004F
#endif
#ifndef XT1OF
#define XT1OF 0x04
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ __MSP430_MPY32_BASE__ + 0x04
#endif
#ifndef MAC
#define MAC __MSP430_MPY32_BASE__ + 0x04
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef TA0CTL
#define TA0CTL 0x0160
#endif
#ifndef TASSEL_0
#define TASSEL_0 (0<<8)
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef IFG2
#define IFG2 0x0003
#endif
#ifndef __MSP430_HAS_USCI__
#define __MSP430_HAS_USCI__ 
#endif
#ifndef __MSP430_HAS_USCI_
#define __MSP430_HAS_USCI_ 
#endif
#ifndef LCDON
#define LCDON 0x01
#endif
#ifndef RTCYEARL_
#define RTCYEARL_ 0x004E
#endif
#ifndef RTCYEARL
#define RTCYEARL 0x004E
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_MAX_10_EXP_
#define __LDBL_MAX_10_EXP_ 38
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef P2IN
#define P2IN 0x0028
#endif
#ifndef P8DIR_
#define P8DIR_ 0x003D
#endif
#ifndef P8DIR
#define P8DIR 0x003D
#endif
#ifndef NMIIFG
#define NMIIFG (1<<4)
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef __MSP430_HAS_SVS_
#define __MSP430_HAS_SVS_ 
#endif
#ifndef LCDFREQ_512
#define LCDFREQ_512 (7<<5)
#endif
#ifndef LCDS0
#define LCDS0 0x01
#endif
#ifndef LCDS4
#define LCDS4 0x02
#endif
#ifndef VLD_10
#define VLD_10 (10<<4)
#endif
#ifndef VLD_11
#define VLD_11 (11<<4)
#endif
#ifndef VLD_12
#define VLD_12 (12<<4)
#endif
#ifndef VLD_13
#define VLD_13 (13<<4)
#endif
#ifndef VLD_14
#define VLD_14 (14<<4)
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef __SIZEOF_WCHAR_T_
#define __SIZEOF_WCHAR_T_ 2
#endif
#ifndef UCA0TXIFG
#define UCA0TXIFG (1<<1)
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef BTCNT1_
#define BTCNT1_ 0x0046
#endif
#ifndef BTCNT1
#define BTCNT1 0x0046
#endif
#ifndef BTCNT2_
#define BTCNT2_ 0x0047
#endif
#ifndef BTCNT2
#define BTCNT2 0x0047
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef UCA1STAT_
#define UCA1STAT_ 0x00D5
#endif
#ifndef UCA1STAT
#define UCA1STAT 0x00D5
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef __MSP430_HAS_TB3__
#define __MSP430_HAS_TB3__ 
#endif
#ifndef __MSP430_HAS_TB3_
#define __MSP430_HAS_TB3_ 
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef RTCCTL_
#define RTCCTL_ 0x0041
#endif
#ifndef RTCCTL
#define RTCCTL 0x0041
#endif
#ifndef LCDS8
#define LCDS8 0x04
#endif
#ifndef UCA0ABCTL_
#define UCA0ABCTL_ 0x005D
#endif
#ifndef UCA0ABCTL
#define UCA0ABCTL 0x005D
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef VLCD_DISABLED
#define VLCD_DISABLED (0<<1)
#endif
#ifndef __MSP430_HAS_SD16_CH1__
#define __MSP430_HAS_SD16_CH1__ 
#endif
#ifndef __MSP430_HAS_SD16_CH1_
#define __MSP430_HAS_SD16_CH1_ 
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR TIMER0_A0_VECTOR
#endif
#ifndef SD16OVIE
#define SD16OVIE 0x0002
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef __DEC_EVAL_METHOD_
#define __DEC_EVAL_METHOD_ 2
#endif
#ifndef LFOF
#define LFOF 0x02
#endif
#ifndef SD16PRE0_
#define SD16PRE0_ 0x00B8
#endif
#ifndef SD16PRE0
#define SD16PRE0 0x00B8
#endif
#ifndef UCB0CTL0_
#define UCB0CTL0_ 0x0068
#endif
#ifndef UCB0CTL0
#define UCB0CTL0 0x0068
#endif
#ifndef LCDACTL_
#define LCDACTL_ 0x0090
#endif
#ifndef LCDACTL
#define LCDACTL 0x0090
#endif
#ifndef __MSP430_HAS_PORTA__
#define __MSP430_HAS_PORTA__ 
#endif
#ifndef __MSP430_HAS_PORTA_
#define __MSP430_HAS_PORTA_ 
#endif
#ifndef SD16PRE1_
#define SD16PRE1_ 0x00B9
#endif
#ifndef SD16PRE1
#define SD16PRE1 0x00B9
#endif
#ifndef __MSP430_HAS_PORT5_R__
#define __MSP430_HAS_PORT5_R__ 
#endif
#ifndef __MSP430_HAS_PORT5_R_
#define __MSP430_HAS_PORT5_R_ 
#endif
#ifndef UCB0CTL1_
#define UCB0CTL1_ 0x0069
#endif
#ifndef UCB0CTL1
#define UCB0CTL1 0x0069
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef BT_fCLK2_ACLK_DIV256
#define BT_fCLK2_ACLK_DIV256 BTDIV
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef SD16PRE2_
#define SD16PRE2_ 0x00BA
#endif
#ifndef SD16PRE2
#define SD16PRE2 0x00BA
#endif
#ifndef SCFI0_
#define SCFI0_ 0x0050
#endif
#ifndef SCFI0
#define SCFI0 0x0050
#endif
#ifndef MPYFRAC
#define MPYFRAC (1<<2)
#endif
#ifndef UCA0MCTL_
#define UCA0MCTL_ 0x0064
#endif
#ifndef UCA0MCTL
#define UCA0MCTL 0x0064
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef __INTMAX_MAX_
#define __INTMAX_MAX_ 9223372036854775807LL
#endif
#ifndef SCFI1_
#define SCFI1_ 0x0051
#endif
#ifndef SCFI1
#define SCFI1 0x0051
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef __FLT_DENORM_MIN_
#define __FLT_DENORM_MIN_ 1.40129846e-45F
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef P5IN
#define P5IN 0x0030
#endif
#ifndef P7DIR_
#define P7DIR_ 0x003C
#endif
#ifndef P7DIR
#define P7DIR 0x003C
#endif
#ifndef SCFQ_128K
#define SCFQ_128K 0x03
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef __CHAR32_TYPE_
#define __CHAR32_TYPE_ unsigned int
#endif
#ifndef VLD_EXT
#define VLD_EXT (15<<4)
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef __FLT_MAX_
#define __FLT_MAX_ 3.40282347e+38F
#endif
#ifndef UCBRS_0
#define UCBRS_0 (0<<1)
#endif
#ifndef UCBRS_1
#define UCBRS_1 (1<<1)
#endif
#ifndef UCBRS_2
#define UCBRS_2 (2<<1)
#endif
#ifndef UCBRS_3
#define UCBRS_3 (3<<1)
#endif
#ifndef UCBRS_4
#define UCBRS_4 (4<<1)
#endif
#ifndef UCBRS_5
#define UCBRS_5 (5<<1)
#endif
#ifndef UCBRS_6
#define UCBRS_6 (6<<1)
#endif
#ifndef UCBRS_7
#define UCBRS_7 (7<<1)
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef RTCTIM0
#define RTCTIM0 RTCNT12
#endif
#ifndef RTCTIM1
#define RTCTIM1 RTCNT34
#endif
#ifndef UCB0STAT_
#define UCB0STAT_ 0x006D
#endif
#ifndef UCB0STAT
#define UCB0STAT 0x006D
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef TAIV
#define TAIV TA0IV_
#endif
#ifndef SD16SSEL_TACLK
#define SD16SSEL_TACLK SD16SSEL_3
#endif
#ifndef OFIE
#define OFIE (1<<1)
#endif
#ifndef USCIAB0RX_VECTOR
#define USCIAB0RX_VECTOR 18
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef __SIZEOF_DOUBLE_
#define __SIZEOF_DOUBLE_ 4
#endif
#ifndef BASICTIMER_VECTOR
#define BASICTIMER_VECTOR 0
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef __INTMAX_TYPE_
#define __INTMAX_TYPE_ long long int
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef __DEC128_MAX_EXP_
#define __DEC128_MAX_EXP_ 6145
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef FLLD_1
#define FLLD_1 0
#endif
#ifndef UCA1TXIFG
#define UCA1TXIFG (1<<1)
#endif
#ifndef P5REN_
#define P5REN_ 0x0012
#endif
#ifndef P5REN
#define P5REN 0x0012
#endif
#ifndef SD16GRP
#define SD16GRP 0x0001
#endif
#ifndef CCIS_0
#define CCIS_0 (0<<12)
#endif
#ifndef UCB1STAT_
#define UCB1STAT_ 0x00DD
#endif
#ifndef UCB1STAT
#define UCB1STAT 0x00DD
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __GNUC_MINOR_
#define __GNUC_MINOR_ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __UINTMAX_MAX_
#define __UINTMAX_MAX_ 18446744073709551615ULL
#endif
#ifndef SD16BUF0
#define SD16BUF0 0x2000
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef __DEC32_MANT_DIG_
#define __DEC32_MANT_DIG_ 7
#endif
#ifndef SD16BUFG
#define SD16BUFG 0x8000
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __DBL_MAX_10_EXP_
#define __DBL_MAX_10_EXP_ 38
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef __LDBL_DENORM_MIN_
#define __LDBL_DENORM_MIN_ 1.40129846e-45L
#endif
#ifndef UCA1IRTCTL_
#define UCA1IRTCTL_ 0x00CE
#endif
#ifndef UCA1IRTCTL
#define UCA1IRTCTL 0x00CE
#endif
#ifndef SD16INCH1
#define SD16INCH1 0x0002
#endif
#ifndef MPYSAT
#define MPYSAT (1<<3)
#endif
#ifndef __MSP430_HAS_PORT4_R__
#define __MSP430_HAS_PORT4_R__ 
#endif
#ifndef __MSP430_HAS_PORT4_R_
#define __MSP430_HAS_PORT4_R_ 
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef __STDC_
#define __STDC_ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef RTCTEV_0
#define RTCTEV_0 (0<<2)
#endif
#ifndef RTCTEV_1
#define RTCTEV_1 (1<<2)
#endif
#ifndef RTCTEV_2
#define RTCTEV_2 (2<<2)
#endif
#ifndef RTCTEV_3
#define RTCTEV_3 (3<<2)
#endif
#ifndef BTIFG
#define BTIFG (1<<7)
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef __PTRDIFF_TYPE_
#define __PTRDIFF_TYPE_ long int
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef SCFQCTL_
#define SCFQCTL_ 0x0052
#endif
#ifndef SCFQCTL
#define SCFQCTL 0x0052
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef P2IES
#define P2IES 0x002C
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2_
#endif
#ifndef UCSSEL_1
#define UCSSEL_1 (1<<6)
#endif
#ifndef UCSSEL_2
#define UCSSEL_2 (2<<6)
#endif
#ifndef UCSSEL_3
#define UCSSEL_3 (3<<6)
#endif
#ifndef DCOPLUS
#define DCOPLUS 0x80
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef P8IN_
#define P8IN_ 0x0039
#endif
#ifndef P8IN
#define P8IN 0x0039
#endif
#ifndef SD16LSBACC
#define SD16LSBACC 0x0040
#endif
#ifndef __msp430x47xx
#define __msp430x47xx 
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef SD16XDIV_DIV1
#define SD16XDIV_DIV1 SD16XDIV_0
#endif
#ifndef SD16XDIV_DIV2
#define SD16XDIV_DIV2 SD16XDIV_1
#endif
#ifndef SD16XDIV_DIV4
#define SD16XDIV_DIV4 SD16XDIV_2
#endif
#ifndef SD16XDIV_DIV8
#define SD16XDIV_DIV8 SD16XDIV_3
#endif
#ifndef UCB1CTL0_
#define UCB1CTL0_ 0x00D8
#endif
#ifndef UCB1CTL0
#define UCB1CTL0 0x00D8
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC64_SUBNORMAL_MIN_
#define __DEC64_SUBNORMAL_MIN_ 0.000000000000001E-383DD
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __DEC128_MANT_DIG_
#define __DEC128_MANT_DIG_ 34
#endif
#ifndef UCB1CTL1_
#define UCB1CTL1_ 0x00D9
#endif
#ifndef UCB1CTL1
#define UCB1CTL1 0x00D9
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef __MSP430_CPU_
#define __MSP430_CPU_ 0
#endif
#ifndef SD16GAIN_1
#define SD16GAIN_1 (0<<3)
#endif
#ifndef SD16GAIN_2
#define SD16GAIN_2 (1<<3)
#endif
#ifndef SD16GAIN_4
#define SD16GAIN_4 (2<<3)
#endif
#ifndef SD16GAIN_8
#define SD16GAIN_8 (3<<3)
#endif
#ifndef P9OUT_
#define P9OUT_ 0x000A
#endif
#ifndef P9OUT
#define P9OUT 0x000A
#endif
#ifndef VLCD0
#define VLCD0 0x02
#endif
#ifndef VLCD1
#define VLCD1 0x04
#endif
#ifndef VLCD2
#define VLCD2 0x08
#endif
#ifndef VLCD3
#define VLCD3 0x10
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef __SIZEOF_LONG_LONG_
#define __SIZEOF_LONG_LONG_ 8
#endif
#ifndef UCA0RXIFG
#define UCA0RXIFG (1<<0)
#endif
#ifndef UCA0TXBUF_
#define UCA0TXBUF_ 0x0067
#endif
#ifndef UCA0TXBUF
#define UCA0TXBUF 0x0067
#endif
#ifndef UCA1MCTL_
#define UCA1MCTL_ 0x00D4
#endif
#ifndef UCA1MCTL
#define UCA1MCTL 0x00D4
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef FN_8
#define FN_8 0x20
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef SD16DIV_DIV1
#define SD16DIV_DIV1 SD16DIV_0
#endif
#ifndef SD16DIV_DIV2
#define SD16DIV_DIV2 SD16DIV_1
#endif
#ifndef SD16DIV_DIV4
#define SD16DIV_DIV4 SD16DIV_2
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef __LDBL_DIG_
#define __LDBL_DIG_ 6
#endif
#ifndef P9SEL_
#define P9SEL_ 0x000E
#endif
#ifndef P9SEL
#define P9SEL 0x000E
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef SHR_0
#define SHR_0 (0<<13)
#endif
#ifndef SHR_1
#define SHR_1 (1<<13)
#endif
#ifndef SHR_2
#define SHR_2 (2<<13)
#endif
#ifndef SHR_3
#define SHR_3 (3<<13)
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef __GNUC_GNU_INLINE_
#define __GNUC_GNU_INLINE_ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef OFIFG
#define OFIFG (1<<1)
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef P4REN_
#define P4REN_ 0x0011
#endif
#ifndef P4REN
#define P4REN 0x0011
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef CAPD
#define CAPD 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x47xx : public Variant {
	public:
		Variant_msp430x47xx() {}
		virtual ~Variant_msp430x47xx() {}
		const char *getName() { return "msp430x47xx"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


